validation-backwardStep-2D/Case-0/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 50;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 50;
    }
    right
    {
       type             zeroGradient;
    }
    "(side1|side2)"
    {
        type            empty;
    }
    "(top|down|lowerWall)"
    {
        type            epsilonWallFunction;
//        blending        exponential;
        value           $internalField;
    }
}


// ************************************************************************* //
