validation-backwardStep-2D/Case-0/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
1110
(
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    side1
    {
        type            empty;
    }
    side2
    {
        type            empty;
    }
    right
    {
        type            calculated;
        value           uniform 0;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
1600
(
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
...
)
;
    }
    down
    {
        type            calculated;
        value           nonuniform List<scalar> 
500
(
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
3.9381
...
)
;
    }
}


// ************************************************************************* //
