validation-backwardStep-2D/Case-0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

h 0.0127;
H   #eval{8*$h+$h};
x1  #eval{-110*$h};
x2  #eval{50*$h};
dz1  #eval{-0.25*$h};
dz2  #eval{0.25*$h};

vertices
(
    (0 0 $dz1) //0
    ($x2 0 $dz1)  //1
    ($x2 $h $dz1) //2
    (0 $h $dz1) //3
    (0 0  $dz2)   //4
    ($x2 0  $dz2)  //5
    ($x2 $h  $dz2) //6
    (0 $h  $dz2) //7
    
    ($x2 $H $dz1) //8
    (0 $H $dz1) //9
    ($x2 $H  $dz2) //10
    (0 $H  $dz2) //11
    
    ($x1 $h $dz1) //12
    ($x1 $H $dz1) //13
    ($x1 $h  $dz2) //14
    ($x1 $H  $dz2) //15
);

blocks
(
    hex (0  1  2  3 4 5  6  7) (500 10 1) simpleGrading (1 1 1)
    hex (3  2  8  9 7 6 10 11) (500 80 1) simpleGrading (1 1 1)
    hex (12 3 9 13 14 7 11 15) (1100 80 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lowerWall
    {
        type wall;
        faces
        (
            (12 3 7 14)
            (0 4 7 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (12 14 15 13)
        );
    }
    side1
    {
        type empty;
        faces
        (
            (4 5 6 7)
            (7 6 10 11)
            (11 15 14 7)
        );
    }
    side2
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (3 2 8 9)
            (3 9 13 12)
        );
    }
    right
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (2 6 10 8)
        );
    }
    top
    {
        type wall;
        faces
        (
            (13 9 11 15)
            (9 8 10 11)
        );
    }
    down
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }

);

// ************************************************************************* //
